{
    "intents": [
      {"intent": "GeneralExpenseTracking", "patterns": [
        "What's my total expenditure?",
        "How much did I spend this month?",
        "Show me my spending for this month.",
        "How much have I spent this month?",
        "Give me my monthly expenditure.",
        "What’s my total spending this month?",
        "Show me my expenses for this month.",
        "How much did I spend on bills?",
        "Tell me my spending for the last month.",
        "What’s my total for this month?",
        "Give me a summary of my spending.",
        "Show my monthly expense report.",
        "How much did I spend on groceries last month?",
        "Show total expenses for this month.",
        "How much did I spend on transport?",
        "What’s my spending this month?",
        "Provide my expenditure details.",
        "What’s the total amount spent?",
        "Show my spending summary.",
        "How much have I spent this month on dining?"
      ]},
      {"intent": "CategoryWiseExpenseTracking", "patterns": [
        "How much did I spend on entertainment?",
        "Break down my expenses by category.",
        "What is the percentage of my income spent on rent?",
        "How does my spending on dining out compare to last month?",
        "Show my expenses categorized by type.",
        "How much did I spend on groceries this month?",
        "What are my major expense categories?",
        "Display a breakdown of my expenses by category.",
        "How much have I spent on utilities?",
        "Show me a chart of expenses by category.",
        "What’s the spending distribution for this month?",
        "How much did I spend on transportation?",
        "Categorize my expenses for the past month.",
        "Show me how much I spent on each category.",
        "How does my spending compare across categories?",
        "Break down my spending into categories.",
        "What’s my spending in each category?",
        "Give me a summary of expenses by category.",
        "Show the percentage of total spending by category.",
        "How much did I spend on dining last month?"
      ]},
      {"intent": "IncomeManagement", "patterns": [
        "What was my total income last month?",
        "Add a new income source.",
        "How much did I earn from freelancing this year?",
        "Show my total income for this year.",
        "Record a new income entry.",
        "What’s my monthly income?",
        "How much did I earn from investments?",
        "Provide a summary of my income sources.",
        "Show my income breakdown for the year.",
        "How does my income compare to last year?",
        "Add a new salary entry.",
        "Show me my total earnings.",
        "What’s my income from side jobs?",
        "Provide details of my income streams.",
        "How much did I earn from bonuses?",
        "Show income details for the past 6 months.",
        "What’s my total income this month?",
        "How much did I make from commissions?",
        "Record a new income source of $500.",
        "Show a graph of my income trends."
      ]},
      {"intent": "InvestmentTracking", "patterns": [
        "What's the current value of my investments?",
        "Show me a summary of my investments.",
        "How much have I invested in stocks?",
        "What was the return on my investments last quarter?",
        "Give me an update on my investment portfolio.",
        "How much did I invest in mutual funds?",
        "Show a breakdown of my investment holdings.",
        "What’s the performance of my investments?",
        "Provide details of my investment returns.",
        "How much have I invested in real estate?",
        "Show me my investment growth over time.",
        "What are my major investments?",
        "Display my investment summary.",
        "How does my investment portfolio look?",
        "Give me a report on my investment performance.",
        "How much did I earn from investments this month?",
        "Show me a chart of my investment returns.",
        "Provide details of my latest investments.",
        "How much have my investments grown?",
        "What’s the status of my retirement fund?"
      ]},
      {"intent": "AnalyticsAndGraphs", "patterns": [
        "Show me a graph of my monthly spending.",
        "Compare my income and expenses over the last 6 months.",
        "Display a pie chart of my expenses by category.",
        "Show me a trend of my savings over time.",
        "Give me a visualization of my spending patterns.",
        "Provide a graph of my income versus expenses.",
        "Show analytics for my financial data.",
        "Display a bar chart of monthly expenses.",
        "Show me a trend line of my income growth.",
        "Give me a summary of my spending with visuals.",
        "What are the trends in my financial data?",
        "Show me a scatter plot of income versus expenses.",
        "Provide a visual representation of my budget.",
        "How do my expenses compare year over year?",
        "Show a line graph of my savings changes.",
        "Display a comparison chart of my income sources.",
        "Give me a graph of my expense categories.",
        "Show monthly expense trends with a graph.",
        "Visualize my spending history.",
        "Provide a dashboard of my financial analytics."
      ]},
      {"intent": "BudgetManagement", "patterns": [
        "How much of my budget is left for this month?",
        "Did I exceed my grocery budget?",
        "Set a new budget for dining out.",
        "Alert me when I am close to exceeding my budget.",
        "Show me my current budget status.",
        "How much of my monthly budget have I used?",
        "Provide a summary of my budget allocation.",
        "Show me my budget vs actual spending.",
        "How does my spending compare to my budget?",
        "Adjust my budget for utilities.",
        "What’s my remaining budget for this category?",
        "Show me a breakdown of my budget utilization.",
        "How much is left in my entertainment budget?",
        "Provide an overview of my budgeted vs actual expenses.",
        "Set a new budget limit for transportation.",
        "How close am I to reaching my budget limit?",
        "Show me the percentage of my budget spent.",
        "Give me insights into my budget adherence.",
        "How does my current spending compare to my budget?",
        "Adjust my overall monthly budget."
      ]},
      {"intent": "FuturePlanning", "patterns": [
        "How much do I need to save for my upcoming vacation?",
        "What is my projected savings by the end of the year?",
        "Can I afford to buy a new laptop with my current budget?",
        "Show me a plan for my financial goals.",
        "How much should I save each month to reach my goal?",
        "Provide a projection of my future savings.",
        "What’s my savings target for the next year?",
        "Plan a budget for an upcoming event.",
        "How much do I need to invest to reach my retirement goal?",
        "Show me a savings plan for a house down payment.",
        "What are my financial goals for the next 5 years?",
        "Provide a roadmap for my future investments.",
        "How much should I set aside for an emergency fund?",
        "Give me a forecast of my financial growth.",
        "Plan my budget for a major purchase.",
        "How can I reach my savings goal faster?",
        "Provide a strategy for achieving my financial objectives.",
        "What’s my financial plan for the next quarter?",
        "How much will I need to save for my child’s education?",
        "Show me a plan to pay off my debts."
      ]}
    ]
  }
  