{
  "intents": [
    {
      "intent": "CategoryWiseExpenseTracking", 
      "patterns": [
        "How much did I spend on entertainment this month?",
        "Break down my monthly expenses by category.",
        "What is the percentage of income spent on transportation?",
        "How does my spending on food compare to other categories?",
        "Show my expenses categorized by type this month.",
        "What are my top expense categories?",
        "Display a breakdown of expenses by category.",
        "How much have I spent on health this month?",
        "Show me a chart of my expenses categorized by type.",
        "What’s the spending distribution across different categories?",
        "Categorize my expenses for the current month.",
        "Show me my top spending categories for the last month.",
        "How does my spending compare across various categories?",
        "Break down my spending for the last quarter.",
        "What’s my expense distribution by category?",
        "Give me a summary of my spending by category for this month.",
        "Show the percentage of total spending by each category.",
        "How much did I spend on education last quarter?",
        "Provide a breakdown of my monthly expenses by type.",
        "How much did I spend on food and dining last month?"
      ]
    },
    {
      "intent": "IncomeManagement", 
      "patterns": [
        "What was my total income for the last quarter?",
        "Add a new freelance income source.",
        "How much did I earn from my part-time job this year?",
        "Show my total earnings from investments.",
        "Record a new income entry for a bonus.",
        "What’s my average monthly income?",
        "How much did I make from rental properties?",
        "Provide a breakdown of my income sources for this year.",
        "Show my income summary for the past year.",
        "How does my income this year compare to last year?",
        "Add a new income source from consulting.",
        "Show me my total earnings for this month.",
        "What’s my income from investments this quarter?",
        "Provide details of my various income streams.",
        "How much did I earn from dividends?",
        "Show income details for the last 12 months.",
        "What’s my total income for the last six months?",
        "How much did I make from online sales?",
        "Record a new income source of $1000.",
        "Show a graph of my income fluctuations over the last year."
      ]
    },
    {
      "intent": "InvestmentTracking", 
      "patterns": [
        "What's the current value of my stock portfolio?",
        "Show me a summary of my mutual fund investments.",
        "How much have I invested in bonds?",
        "What was the return on my investments last year?",
        "Give me an update on my real estate investments.",
        "How much did I invest in cryptocurrency?",
        "Show a breakdown of my investments by type.",
        "What’s the performance of my portfolio this quarter?",
        "Provide details of my investment growth over time.",
        "How much have I invested in gold?",
        "Show me my investment performance for the past year.",
        "What are my top-performing investments?",
        "Display my investment portfolio summary.",
        "How does my investment portfolio compare to last year?",
        "Give me a report on my stock investments.",
        "How much did I earn from mutual funds this month?",
        "Show me a chart of my portfolio’s growth.",
        "Provide details of my latest real estate investments.",
        "How much have my investments appreciated?",
        "What’s the status of my long-term investment plan?"
      ]
    },
    {
      "intent": "AnalyticsAndGraphs", 
      "patterns": [
        "Show me a graph of my yearly spending trends.",
        "Compare my income and expenses for the last quarter.",
        "Display a pie chart of my expenses by category for this month.",
        "Show me a trend of my savings over the past two years.",
        "Give me a visualization of my income and expenses.",
        "Provide a graph of my financial data for the last six months.",
        "Show analytics for my budget adherence.",
        "Display a bar chart of my monthly income versus expenses.",
        "Show me a trend line of my investment growth over time.",
        "Give me a summary of my spending patterns with visuals.",
        "What are the key trends in my financial data for this year?",
        "Show me a scatter plot of my spending habits.",
        "Provide a visual representation of my budget utilization.",
        "How do my expenses compare year over year?",
        "Show a line graph of my savings changes over time.",
        "Display a comparison chart of my income and expenses.",
        "Give me a graph of my spending by category for the last quarter.",
        "Show monthly income trends with a graph.",
        "Visualize my financial history.",
        "Provide a dashboard of my financial analytics for this year."
      ]
    },
    {
      "intent": "BudgetManagement", 
      "patterns": [
        "How much of my budget is left for this quarter?",
        "Did I exceed my budget for dining last month?",
        "Set a new budget for travel expenses.",
        "Alert me when I am close to my budget limit for utilities.",
        "Show me my current budget status for entertainment.",
        "How much of my monthly budget have I used for groceries?",
        "Provide a summary of my budget for this month.",
        "Show me my budget versus actual spending for this quarter.",
        "How does my spending compare to my budget for transportation?",
        "Adjust my budget allocation for savings.",
        "What’s my remaining budget for rent?",
        "Show me a breakdown of my budget utilization for dining.",
        "How much is left in my entertainment budget for this month?",
        "Provide an overview of my budgeted versus actual expenses.",
        "Set a new budget limit for utilities.",
        "How close am I to reaching my budget limit for shopping?",
        "Show me the percentage of my budget spent on utilities.",
        "Give me insights into my budget management for the last quarter.",
        "How does my current spending compare to my budget?",
        "Adjust my budget allocation for groceries."
      ]
    }
  ]
}
